{
    "Company Name": "AEi Systems, Inc.",
    "Tagline": "Analytical Heavy Lifting",
    "Followers": "616  followers",
    "Employee Count": "11-50 employees",
    "Industry": "Defense and Space Manufacturing",
    "Location": "Centennial, Colorado",
    "Overview": "AEi Systems is an engineering analysis firm whose customers include nearly all the world’s leading aerospace/defense, automotive and IC manufacturers.\n\nAEi Systems was established as an Analytical Engineering firm in 1995 to support the increasing demand for Worst Case Analysis in the Space market. Due to AEi Systems' core strengths in circuit analysis and simulation, AEi Systems now performs analysis for all sectors of the economy including automotive, nuclear, medical, maritime, military, and aerospace. \n\nIn 2018, AEi Systems continues the long tradition of service to a demanding clientele. Our offerings continue to grow dramatically through repeat business and referrals.\n\nAEi Systems maintains a talented staff of full-time analysts and a secure network of experts and consultants that enable us to deliver our products and services on time, under budget and to customer specification. \n\nAEi Systems offers Engineering Services including:\n•\tWorst-case Circuit Analysis for Power, RF, Digital, and Linear systems of \n        all types (http://www.aeng.com/wcca.htm)\n•\tPre-WCCA Design Review or WCCA Review \n        (https://www.aeng.com/design_review.htm) / WCCA Bidding Support / \n        WCCA for Hybrids\n•\tSignal & Power Integrity Analysis (www.aeng.com/signal.htm and https://www.aeng.com/pi.htm)\n•\tAll Electrical SDRLs: MTBF, FMEA/FMECA, Stress & Derating \n        (http://www.aeng.com/stress.htm), and Radiation Analysis \n        (https://www.aeng.com/radiation.htm)\n•\tTesting: Component and Circuits, Custom Test Board/EVM Development\n\nIf there is any interest for current or future programs, please feel free to call (310-216-1144) with any questions or visit http://www.AEiSystems.com/ for information about our Analog, Power, RF, and Digital Reliability Engineering Services.",
    "Website": "http://www.aeisystems.com",
    "Phone": "310-216-1144Phone number is 310-216-1144",
    "Company size": "11-50 employees",
    "Associated Members": "19 associated membersLinkedIn members who’ve listed AEi Systems, Inc. as their current workplace on their profile.",
    "Headquarters": "Centennial, Colorado",
    "Founded": "1995",
    "Specialties": "Space, Reliability, Power, WCCA, Digital, RF, and Analog Analysis, Low Voltage Power Supplies, SPICE Modeling, Worst Case Circuit Analysis, RF Analysis, Signal Integrity, Power Integrity, Analysis, Radiation, Power Integrity, FMECA, Stress & Derating, Signal Integrity, SPICE, and Design Review",
    "jobs_status": "No jobs found for this company."
}