{
    "Company Name": "ASPINA America",
    "Tagline": "Inspired to partner ideas with solutions that will shape the world of tomorrow.",
    "Followers": "2K  followers",
    "Employee Count": "501-1K employees",
    "Industry": "Appliances, Electrical, and Electronics Manufacturing",
    "Location": "Culver City, CA",
    "Overview": "ASPINA conceptualizes and nurtures new ideas together with our customers in order to propose optimum \"movement\" solutions from new perspectives.\n\nAs of September 2019, Shinano Kenshi Corporation began the migration of its corporate brand to a new global brand called ASPINA.  \n\nUtilizing our company’s unsurpassed technical and problem-solving ability, which has been accumulated for over a century, we will continue to give form to the hope and comfort of people throughout the world in market areas including industrial machinery, home appliances, household equipment, automobiles, medicine, and social welfare. Our goal is to provide an even greater contribution in these areas on a grand global scale.\n \n*ABOUT OUR NEW NAME*\nThe name ASPINA was formed by placing the letter “A” on both sides of the word “SPIN.” The word SPIN refers to the silk spinning which was the original business of Shinano Kenshi, as well as the spinning of motors. The letter A refers to a brand that weaves Class A products together with customers. ASPINA also refers to the word “Aspire,” sending the message of “eagerness, desire, fervent wish, aim, and intention.”\n \n*ENGINEERED TO INSPIRE*\nASPINA contains the concept of using technology (= Engineered) to achieve results that will influence the future of the world (= Inspire). This message conveys how we work to realize new innovation and improvements together with our partners.\n\nWhat we offer:\n\n*Solutions in Motion*\nThrough the design, manufacturing, and supply of modules and systems, such as pumps, fans, and motors with reduction gears, we offer technical proposals for rapid issue resolution. We are experts in providing \"movement\" solutions. \n\n*Pursuing Compact, Light, Quiet*\nTo meet the needs of emerging and changing industries, we propose and develop compact, lightweight, and quiet products.\n\nWhat we serve for:\n*Automation\n*Life Environment\n*Automotive\n*Health & Wellness \n*Space \n\nContact us today.",
    "Website": "https://us.aspina-group.com/en/",
    "Phone": "310-693-7600Phone number is 310-693-7600",
    "Company size": "501-1,000 employees",
    "Associated Members": "107 associated membersLinkedIn members who’ve listed ASPINA America as their current workplace on their profile.",
    "Headquarters": "Culver City, CA",
    "Founded": "1918",
    "jobs_status": "No jobs found for this company."
}