{
    "Company Name": "ASTER Labs, Inc.",
    "Followers": "502  followers",
    "Employee Count": "11-50 employees",
    "Industry": "Aviation and Aerospace Component Manufacturing",
    "Location": "Shoreview, Minnesota",
    "Overview": "ASTER (Advanced Space and Technology Research) Labs provides research services to its clients for advanced topics in spacecraft development and operation applications, as well as technology that can be applied to future aerospace vehicle enhancements. ASTER Labs personnel hold several patents on topics related to spacecraft navigation and control, as well as terrestrial navigation.\r\n\r\nASTER Labs has worked on contracts with U.S. governmental agencies, University-related research laboratories and industry sources in the following areas related to autonomous spacecraft systems:\r\n•\tAutonomous interplanetary navigation, including outer planets and asteroids\r\n•\tAutonomous aerospace vehicle navigation and control at both large and small vehicle scales\r\n•\tRelative navigation, including rendezvous and docking of vehicles\r\n•\tHigh accuracy time transfer used for time alignment and communication\r\n\r\nIn addition to high performance navigation technologies, the company is pursuing passive and active energy generation systems for self-sufficient operations, including solar and wind technologies.   \r\n\r\nASTER Labs also produces Orbitus ED, a graphical user interface (GUI) written in MATLAB accomplished at displaying satellite orbits, orbit transfers, rendezvous, as well as generating usable data associated with these trajectories and maneuvers. Designed as an education tool, it is also an excellent tool for use in industry for quick visualizations and analysis of satellite orbits.",
    "Website": "http://www.asterlabs.com",
    "Company size": "11-50 employees",
    "Associated Members": "26 associated membersLinkedIn members who’ve listed ASTER Labs, Inc. as their current workplace on their profile.",
    "Headquarters": "Shoreview, Minnesota",
    "Founded": "2004",
    "Specialties": "Research Prototype Design and Development, Orbital Mechanics and Spacecraft Dynamics, Vehicle and Pedestrian Navigational Research, Kalman Filter Design and Covariance Analysis, Systems Simulation and Analysis, CubeSat Components, and Mobile Device App Development",
    "jobs_status": "No jobs found for this company."
}