{
    "Company Name": "ASTROFEIN - Astro- und Feinwerktechnik Adlershof GmbH",
    "Tagline": "Passion for Space. ASTROFEIN. We develop, produce and test components and systems for space.",
    "Followers": "2K  followers",
    "Employee Count": "51-200 employees",
    "Industry": "Aviation and Aerospace Component Manufacturing",
    "Location": "Berlin, Berlin",
    "Overview": "ASTROFEIN develops, produces and tests components and systems for space. We focus on small satellites, attitude control, structures, mechanisms and payloads. The comprehensive knowledge, expertise and experience of the employees ensure a high quality standard in different fields of the space technologies. ASTROFEIN is one of the world's leading manufacturers of reaction wheels. A family of reaction wheels for small satellites was successfully launched on the market. The family of ASTROFEIN reaction wheels comprises six reaction wheels – RW 1, RW 35, RW 90, RW 150, RW 250 and the RW 800. We are pleased to announce one of our newest products, the 6U PicoSatellite Launcher (PSL), as a new member of our PSL family that established already the PSL1U, PSL2U, PSL3U and PSL12U.",
    "Website": "http://www.astrofein.com",
    "Phone": "+49 30 6392 1000Phone number is +49 30 6392 1000",
    "Company size": "51-200 employees",
    "Associated Members": "26 associated membersLinkedIn members who’ve listed ASTROFEIN - Astro- und Feinwerktechnik Adlershof GmbH as their current workplace on their profile.",
    "Headquarters": "Berlin, Berlin",
    "Founded": "1993",
    "Specialties": "Attitude Control, Reaction Wheels, Gyro-System, ACS Test Facility, Simulation Models, GNSS Receiver, CubeSat Deployer, Solar Panels, Deployable Booms, Ground Support Equipment, Filter Wheel, Camera Development, Test Bed for Rotation Sensors, Environmental Simulation, Vibration, Pyroshock Tests, Static Load Test, Thermal Vauum Chamber, Temperature Test, and Small Satellites",
    "jobs_status": "No jobs found for this company."
}