{
    "Company Name": "Concepts NREC",
    "Tagline": "Experts in turbomachinery with integrated solutions across engineering, CAE & CAM software, manufacturing and training",
    "Followers": "6K  followers",
    "Employee Count": "51-200 employees",
    "Industry": "Mechanical Or Industrial Engineering",
    "Location": "White River Junction, VT",
    "Funding": "US$ 199.3K",
    "Funds_status": "Grant",
    "Overview": "For over 65 years, Concepts NREC has been partnering with the world’s leading OEMs to improve the performance and manufacturability of their turbomachines. We are the only company in the world whose in-house capabilities span the entire design process from preliminary concept through manufacturing and installation. This unique perspective creates powerful synergies that drive innovation across our entire offer. Clients benefit from having a trusted partner that can see the big picture and provide valuable insights that save them time and money.  \n\nAdvancing the State of the Art in Turbomachinery\n\nConcepts NREC can manage client projects from start to finish or augment their in-house capabilities at any point in the design process. Our goal is to push past what has been done to explore what can be done. We have the vision to create great designs and a hard-earned reputation for delivering them.\nHeadquartered in Vermont, USA, Concepts NREC has a staff of over one hundred professionals strategically located throughout the world.  We can manage projects from preliminary concept to installation; or augment your in-house capabilities at any point in the design and development process. \n \nConcepts NREC offers:\n•\tComputer Aided Engineering (CAE) software\n•\tComputer Aided Manufacturing (CAM) software\n•\tDesign audits  & scoping studies\n•\tIn-house laboratory  testing and R&D\n•\tPrecision prototypes\n•\tSpecialized products\n•\tPrototype and production run manufacturing\n\nContact us to find out how we can help you achieve your goals.",
    "Website": "http://www.conceptsnrec.com",
    "Company size": "51-200 employees",
    "Associated Members": "162 associated membersLinkedIn members who’ve listed Concepts NREC as their current workplace on their profile.",
    "Headquarters": "White River Junction, VT",
    "Founded": "1956",
    "Specialties": "Engineering Services, CAE Software, Turbomachinery design and development, Manufacturing, Dynamometers and Torque Meters, Training & Textbooks, CAM Software, Turbomachinery Design Software, 5-Axis Machining, Prototypes & Small Production Runs, Radial Compressors, Axial Compressors, Turbochargers, SCO2, Gas Turbine Design, Radial Turbines, and Art to Part Solutions for Turbomachinery",
    "jobs_status": "No jobs found for this company."
}