{
    "Company Name": "Crystal Instruments",
    "Tagline": "Leading innovation in vibration testing, condition monitoring, and data acquisition since 1996.",
    "Followers": "4K  followers",
    "Employee Count": "11-50 employees",
    "Industry": "Industrial Machinery Manufacturing",
    "Location": "Santa Clara, California",
    "Overview": "Crystal Instruments stands at the forefront of technological innovation in the dynamic data acquisition, vibration control, and machine condition monitoring industries. From our meticulous design at the component level (circuit board, FPGA code, firmware, algorithms, and DSP) to the expansive and user-engineered testing at the software level, our commitment to precision, accuracy, and the overall user experience stands out as our top priorities.\n \nWith our products proudly crafted at our manufacturing facility in the heart of Silicon Valley, California, we take pride in our product’s durability from the initial installation setup and usage for years to come. In fact, we still have most of our first products, the CoCo 80, still in field use to this day.  Along with our dedication to superior quality products, our sales and support team will expertly guide you from the initial discovery call throughout the full device lifetime, with unparalleled expertise along the way for seamless testing solutions.\n \nIn the ever-evolving environmental testing landscape, our products have been utilized in industries such as defense, automotive, aerospace, consumer products, mining, energy, healthcare, and many more. In these industries, custom engineering solutions or contract testing at our state-of-the-art labs are often necessary, which we conveniently supply.\n \nIf you have data acquisition needs, vibration control, or rotating/structural health machine condition monitoring needs and would like to schedule a 1 on 1 consultation, please email us at sales@go-ci.com or call 408-986-8880.",
    "Website": "http://www.crystalinstruments.com",
    "Phone": "4089868880Phone number is 4089868880",
    "Company size": "11-50 employees",
    "Associated Members": "31 associated membersLinkedIn members who’ve listed Crystal Instruments as their current workplace on their profile.",
    "Headquarters": "Santa Clara, California",
    "Founded": "1996",
    "Specialties": "Test and measurement equipment, Machine condition monitoring equipment, Dynamic Measurement, Vibration Data Collectors, Vibration Analysis, Dynamic Signal Analyzers, Vibration Controllers, Accoustic Analyzers, High Channel Count Systems, Vibration Testing, Modal Analysis, Modal Testing, and Environmental Testing",
    "Product Manager – Vibration Analysis (CAT 3+ Certification)Product Manager – Vibration Analysis (CAT 3+ Certification)": {
        "title": "Product Manager – Vibration Analysis (CAT 3+ Certification)Product Manager – Vibration Analysis (CAT 3+ Certification)",
        "company": "Crystal Instruments",
        "location": "Santa Clara, CA (On-site)",
        "applicants": "0 applicants",
        "status": "Unknown status"
    }
}