{
    "Company Name": "Mudd Law",
    "Tagline": "Space | Internet | Creatives | IP | Startups",
    "Followers": "3K  followers",
    "Employee Count": "2-10 employees",
    "Industry": "Legal Services",
    "Location": "Chicago, Illinois",
    "Overview": "With a strong focus on space law, Internet law, and technology law, Mudd Law provides dynamic, insightful, and strategic representation to domestic and international clients. More specifically, our firm's work in space law and policy involves representation in licensing, ITAR/EAR, export control, as well as matters interacting with the FAA, FCC, NOAA, and other agencies. As to Internet law, our firm represents clients in defamation, privacy, domain names, cybersquatting, revenge porn, and websites. We also focus on AI, ML, drones, space, and virtual reality. For our business clients, we provide services in relation to entity formation, governance, contracts. and intellectual property.\n\nFor its business clients, the Firm provides seasoned advice and counsel on matters related to corporate structure, data security (cybersecurity), employment agreements, GDPR, intellectual property (copyrights, domain names, patents, trademarks, trade secrets), Internet, non-compete and non-disclosure agreements, policies, reputation, and social media.  The Firm also represents its clients in litigation before state and federal courts throughout the United States. \n\nAlthough we represent businesses across a diverse range of products and services, Mudd Law provides nuanced strategic advice to clients focused in the space, drone, Internet, software, AR/MR/VR, and video gaming industries.  We also possess a heightened passion for clients in the creative and manufacturing sectors, as well as all entrepreneurs and startups.\n\nFor individual clients, the Firm provides strategic representation in areas associated with privacy and reputation, particularly cyberbullying, defamation, eavesdropping, identity theft, litigation, unauthorized access to email, revenge porn, surveillance, unauthorized publication of private material, and related matters.\n\nWe welcome the opportunity to discuss how we can share our experience and knowledge to your advantage.",
    "Website": "http://www.muddlaw.com",
    "Phone": "312 964 5051Phone number is 312 964 5051",
    "Company size": "2-10 employees",
    "Associated Members": "12 associated membersLinkedIn members who’ve listed Mudd Law as their current workplace on their profile.",
    "Headquarters": "Chicago, Illinois",
    "Founded": "2001",
    "Specialties": "Cyberbullying, Defamation, Eavesdropping, Film, Internet Law, Intellectual Property, Privacy, Small Business, Social Media Policies, Startups, Trade Secrets, Trademarks, P2P BitTorrent Litigation, Drones, Data Security, Cybersecurity, Video Games, Data Security, GDPR, Space Law, Commercial Litigation, and Copyrights",
    "Litigation AttorneyLitigation Attorney": {
        "title": "Litigation AttorneyLitigation Attorney",
        "company": "Mudd Law",
        "location": "Chicago, IL (Hybrid)",
        "applicants": "0 applicants",
        "status": "Unknown status"
    }
}