{
    "Company Name": "NASA Goddard Space Flight Center",
    "Tagline": "Welcome to the largest community of scientists, engineers and technologists on planet Earth. 👩‍🔬🚀",
    "Followers": "194K  followers",
    "Employee Count": "5K-10K employees",
    "Industry": "Defense & Space",
    "Location": "Greenbelt, MD",
    "Overview": "NASA's Goddard Space Flight Center is a major U.S. laboratory for developing and operating unmanned scientific spacecraft. The center manages many of NASA's Earth observation, astronomy, planetary science and astrophysics missions.\n\nNASA's Goddard Space Flight Center in Greenbelt, Maryland, is home to the nation's largest organization of scientists, engineers and technologists who build spacecraft, instruments and new technology to study Earth, the sun, our solar system and the universe.\n\nJust outside Washington, Goddard is home to Hubble operations and the upcoming James Webb Space Telescope. Goddard manages communications between mission control and orbiting astronauts aboard the International Space Station. Goddard scientists stare into the sun, grind up meteorites for signs of life's building blocks, look into the farthest reaches of space, and untangle the mysteries of our own changing world. Goddard engineers construct sensitive instruments, build telescopes that peer into the cosmos, and operate the test chambers that ensure those satellites' survival.\n\nNamed for American rocketry pioneer Dr. Robert H. Goddard, the center was established May 1, 1959, as NASA's first space flight complex. Goddard and its several installations are critical in carrying out NASA's missions of space exploration and scientific discovery.\n\nGoddard encompasses several other NASA properties, most significantly:\n\n• Wallops Flight Facility near Chincoteague, Virginia\n• Katherine Johnson Independent Verification and Validation Facility in Fairmont, West Virginia\n• Goddard Institute for Space Studies in New York City\n• White Sands Complex outside Las Cruces, New Mexico\n• Columbia Scientific Balloon Facility in Palestine, Texas",
    "Website": "https://www.nasa.gov/goddard",
    "Company size": "5,001-10,000 employees",
    "Associated Members": "4,471 associated membersLinkedIn members who’ve listed NASA Goddard Space Flight Center as their current workplace on their profile.",
    "Headquarters": "Greenbelt, MD",
    "Founded": "1959",
    "Specialties": "earth science, space science, engineering, space operations, spacecraft design and construction, astrophysics, planetary science, heliophysics, satellite servicing, and space communications",
    "jobs_status": "No jobs found for this company."
}