{
    "Company Name": "NPC SPACEMIND",
    "Tagline": "Your solution provider for nanosatellite and space applications",
    "Followers": "2K  followers",
    "Employee Count": "11-50 employees",
    "Industry": "Aviation and Aerospace Component Manufacturing",
    "Location": "Imola, Emilia Romagna",
    "Overview": "NPC SPACEMIND is a versatile italian space company with the vision of becoming a onestop shop for innovative products and space projects. \nLed by Aerospace Engineers and a variety of professionals, the company belongs to a larger consolidated company group, leader in the production and supply of mechatronic complex systems: thanks to this corporate configuration the business model is targeted to offer the customer an end-to-end solution provider for space products, offering on one hand all the advantages of a young, lean and flexible company and on the other hand the capabilities to manage in-house all the processes starting from complete system design, going through mechanical, electrical and software production up to delivery and commissioning. Since 2012 SPACEMIND activities have been focused on the problem of space debris, aiming to embrace the growing space business offering solutions to allow future generations to deal with a safe and sustainable use of space. With a view to tackling the problem from both points of view, terrestrial and spatial, two important technologies have been developed. The first is the project MORAL, a family of modular tracking mount for professional observatories with the scope to raise up the performances and disrupt the state of the art of current SSA/SST activities. On space segment the development of ARTICA, a deorbiting system for Cuebsat currently in orbit for IOD, is aimed to introduce an affordable and competitive mitigation solution for future space missions. Thanks to the production and delivery in orbit of multiple nanosatellites in cooperation with Italian Academic center of excellence, nowadays SPACEMIND is a recognized hardware and mission developer & integrator in nanosatellite markets.",
    "Website": "https://www.npcspacemind.com/",
    "Company size": "11-50 employees",
    "Associated Members": "11 associated membersLinkedIn members who’ve listed NPC SPACEMIND as their current workplace on their profile.",
    "Headquarters": "Imola, Emilia Romagna",
    "jobs_status": "No jobs found for this company."
}