{
    "Company Name": "Nye Lubricants, Member of the FUCHS Group",
    "Tagline": "Specialty Greases and Oils",
    "Followers": "8K  followers",
    "Employee Count": "51-200 employees",
    "Industry": "Chemical Manufacturing",
    "Location": "Fairhaven, MA",
    "Overview": "Nye Lubricants, Inc. formulates, manufactures, markets and sells high-quality synthetic lubricants. Our product development process is focused on the customers’ performance specifications and cost and warranty requirements. \n\nNye Today\nNye services a broad range of industries, with a concentration of our business in the automotive, in-vacuum manufacturing, computer printer, disc drive, appliance, aerospace, defense, medical device, and photonics markets. We also manufacture industrial maintenance lubricants for incident food contact, high temperature and other extreme environments. All Nye products are carefully engineered materials, formulated for a specific application and typically developed in consultation with a customer’s engineering department. \n\nTechnology\nNye’s products are based on a full range of synthetic chemistries, including polyalphaolefins, esters, glycols, polyphenylethers, silicones, alkylated naphthalenes, and all four types of perfluoropolyethers (PFPE). Through an agreement with Shell Global Solutions, Nye is also the exclusive global reseller of Pennzane™ multiplyalkylated cyclopentane fluids.\n\nMade in America. Marketed to the world. \nNye is a $50+ million sales, 180-employee subsidiary of the Fuchs Group of companies. Our 83,000-square-foot Fairhaven, Massachusetts-based complex includes R&D and production labs, clean room operations, packaging and production lines, and administrative offices. Extending our reach are offices throughout the United States and 16 channel partners strategically serving major markets worldwide.",
    "Website": "http://www.nyelubricants.com",
    "Phone": "508-996-6721Phone number is 508-996-6721",
    "Company size": "51-200 employees",
    "Associated Members": "130 associated membersLinkedIn members who’ve listed Nye Lubricants, Member of the FUCHS Group as their current workplace on their profile.",
    "Headquarters": "Fairhaven, MA",
    "Founded": "1844",
    "Specialties": "Synthetic lubricants, Custom formulations, Extreme Performance Lubrication, and Damping Compounds",
    "jobs_status": "No jobs found for this company."
}