{
    "Company Name": "Optical Support, Inc.",
    "Tagline": "When Precision Matters - \nOptical Engineering,  Mechanical Engineering,   Precision Optical Instruments",
    "Followers": "742  followers",
    "Employee Count": "11-50 employees",
    "Industry": "Defense and Space Manufacturing",
    "Location": "Tucson, Arizona",
    "Overview": "We build custom precision optical systems and subsystems.\n\nWith more than 100 years of optical and mechanical design experience, our staff can work with your team to design, fabricate, align and test your most complex optical systems.  From conceptual design to manufacturing, we’ve assisted companies in a wide range of industries from aerospace, defense and semiconductor to cinematography, biomedical and commercial sensing.\n\nWe use industry standard software tools such as Zemax, SolidWorks with Simulation and MasterCAM to design and analyze optical instruments and to export CAD models directly to CNC machine code. Our in-house CNC machine shop allows us to rapidly produce precision prototypes and move to volume manufacturing of finished products. When a project is complete, we can provide designs, documentation packages, and quality certifications for completed systems.\n\nOSI’s expertise in precision optical instruments, prototyping and production, combined with our vertically integrated internal resources and facilities will allow you to meet your restrictive schedules while achieving ISO 9001/AS9100 certified quality standards.\n\nIf you have optical systems that need engineering and manufacturing resources to realize production, Optical Support can help.\n\n𝑭𝒓𝒐𝒎 𝑬𝑼𝑽 𝒕𝒐 𝑳𝑾𝑰𝑹... 𝑫𝒆𝒔𝒊𝒈𝒏𝒆𝒅, 𝑭𝒂𝒃𝒓𝒊𝒄𝒂𝒕𝒆𝒅, 𝒂𝒏𝒅 𝑨𝒍𝒊𝒈𝒏𝒆𝒅 𝒕𝒐 𝑴𝒊𝒄𝒓𝒐𝒏𝒔!",
    "Website": "https://www.opticalsupportinc.com",
    "Phone": "520-546-0642Phone number is 520-546-0642",
    "Company size": "11-50 employees",
    "Associated Members": "23 associated membersLinkedIn members who’ve listed Optical Support, Inc. as their current workplace on their profile.",
    "Headquarters": "Tucson, Arizona",
    "Founded": "2005",
    "Specialties": "Optical Engineering, Optomechanical Engineering, Solidworks Design, Lens Barrel Design, Optical System Design and Manufacturing, Custom Optical Instruments, CNC Machining, Wire EDM, and Precision Alignment",
    "jobs_status": "No jobs found for this company."
}