{
    "Company Name": "Rohde & Schwarz",
    "Tagline": "Make Ideas Real",
    "Followers": "170K  followers",
    "Employee Count": "10K+ employees",
    "Industry": "Telecommunications",
    "Location": "München, Bayern",
    "Overview": "Rohde & Schwarz is a global technology group striving for a safer and connected world. With its Test & Measurement, Technology Systems and Networks & Cybersecurity Divisions, the company creates tomorrow's innovations today. The company's leading-edge products and solutions empower industrial, regulatory and military customers to attain technological and digital sovereignty.\n\nInnovation has been part of Rohde & Schwarz since the very beginning. The company founders Dr. Lothar Rohde and Dr. Hermann Schwarz were technological pioneers. With their hands-on entrepreneurial spirit, the two college friends entered the unexplored field of RF engineering. Ninety years later, the company is still pushing technological boundaries – as a successful shaper of cutting-edge technologies such as artificial intelligence (AI), 6G, cloud and quantum technologies.\n\nThe privately owned company is known for stability and resilience. Independence is at the core of its entrepreneurial identity. The company finances its growth with its own resources. Because the company does not have to think in terms of quarterly results, it can plan sustainably for the long term. The high added value of Rohde & Schwarz makes the company a reliable, trustworthy and relevant partner for its customers.\n\nImprint: https://www.rohde-schwarz.com/general-information/imprint_101514.html",
    "Website": "http://www.rohde-schwarz.com",
    "Company size": "10,001+ employees",
    "Associated Members": "7,549 associated membersLinkedIn members who’ve listed Rohde & Schwarz or its subsidiary ipoque - a Rohde & Schwarz company as their current workplace on their profile.",
    "Headquarters": "München, Bayern",
    "Founded": "1933",
    "Specialties": "Test and measurement, Broadcasting and studio technology, Secure communications, Monitoring and Network Testing, Production, Sales and service, and Cybersecurity",
    "jobs_status": "No jobs found for this company."
}