{
    "Company Name": "Spirit Electronics",
    "Tagline": "Veteran-owned, woman-owned business that provides superior supply-chain solutions and electronic component distribution",
    "Followers": "2K  followers",
    "Employee Count": "11-50 employees",
    "Industry": "Defense & Space",
    "Location": "Phoenix, Arizona",
    "Overview": "Spirit Electronics is a veteran-owned, woman-owned ​value-added supplier of high reliability components and superior supply chain solutions. As an award-winning, full turnkey distributor, Spirit delivers authorized products from wafer sales through fully screened, radiation and environmentally qualified components.\n\nOur value-added services include SMI/VMI, Electrical and Environmental Testing, Design, Assembly, End-of-Life Management and more:\n• Electronic component distribution, including passive components, discrete semis, memory, interconnect, RF/Microwave and electro-mechanical devices\n• Fulfillment, material planning, material purchasing (full BOM), inventory management, just-in-time delivery, and supply-chain solutions\n• Wafer sort, assembly, test, qualification, radiation services, and simple and complex kitting\n\nOur engineers are experienced in high-speed digital, mixed signal, analog, RF and SOC test-program development. Our team will work seamlessly with you and your team to help meet your market challenges.\n\nWe Own the Qual™\n\nSpirit Electronics performs in-house testing to qualify our components. We take full ownership of the product and any failures up until it is received on our customers’ dock. This assures the parts received are 100% problem-free. Guaranteed.\n\nSpirit’s History & Mission\n\nSpirit Electronics was founded by a Native American woman and continues today as a USAF Veteran, woman owned small business. Spirit’s owner and CEO, Marti McCurdy, has served the military and space industries around the world throughout her career, starting with work on jamming radar systems for fighter jets, to being a Level 3 ultrasonic specialist performing ultrasonic inspections in more than 20 countries. \n\nSpirit strives to be a valued partner to key technology sectors, and our status as VOWOSB, SDB owned-company provides diversity requirement relief to Defense and Aerospace customers.",
    "Website": "https://www.spiritelectronics.com",
    "Phone": "(480) 998-1533Phone number is (480) 998-1533",
    "Company size": "11-50 employees",
    "Associated Members": "41 associated membersLinkedIn members who’ve listed Spirit Electronics as their current workplace on their profile.",
    "Headquarters": "Phoenix, Arizona",
    "Founded": "1979",
    "Specialties": "Xilinx, Vishay, Rakon, JFW Industries, Custom Silicon Solutions, Semicoa, SV Microwave, Value Add Turnkey Services, Full Program Management, electronic components, Texas Instruments, radiation testing, aerospace engineering, supply chain solutions, component testing, defense contractor, legacy components, assembly & kitting, logistics services, and up-screening",
    "jobs_status": "No jobs found for this company."
}