{
    "Company Name": "Thermal Management Technologies",
    "Tagline": "-Solutions to enable even the toughest projects-\nNew:  Release Mechanism,  Std Multifunctional Structures, Louvers",
    "Followers": "527  followers",
    "Employee Count": "11-50 employees",
    "Industry": "Defense and Space Manufacturing",
    "Location": "North Logan, UT",
    "Overview": "TMT offers custom thermal and mechanical flight components to complement spacecraft and cryogenic applications.  Our staff members have extensive experience developing space components and systems from the design stage through integration, test, and launch.    TMT strives to get involved early in product designs to create integrated solutions.  We look forward to supporting your project and developing components for space related applications.  \r\n\r\nTMT will work with your company to identify and design a solution for your project.  Our team has a wide range of experience in 3D CAD, mechanical and thermal design from conception to fabrication and testing.  We strive to be responsive to both small and complex project\r\n\r\nAnalysis tools are used in conjunction with 3D design to ensure complete solutions or to support specific project needs.  Our team has experience in thermal and structural analysis including finite-element and finite-difference programs.  \r\n\r\nTMT offers consulting services to support your project definition, design, or problem resolution.  Our staff has expertise in project management, system engineering, thermal/mechanical design, spacecraft hardware, cryogenics, fluid dynamics, & thermodynamic processes.",
    "Website": "http://www.tmt-ipe.com",
    "Phone": "435-755-6400Phone number is 435-755-6400",
    "Company size": "11-50 employees",
    "Associated Members": "11 associated membersLinkedIn members who’ve listed Thermal Management Technologies as their current workplace on their profile.",
    "Headquarters": "North Logan, UT",
    "Founded": "2008",
    "Specialties": "Custom thermal and mechanical flight components, mechanical and thermal design, space components and systems, thermal and structural analysis including finite-element adn finite-difference programs, PCM Heat Sinks, flexible thermal straps, small spacecraft, heat pipes, radiators, spacecraft structures, and thermal control",
    "jobs_status": "No jobs found for this company."
}